iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
 *****************************************************************************
**
**      Project     : My project
**
**      Component   : LPC2106 (LPC2106)
**
**      Module name : Support files
**
**      File name   : ma_sfr.h
**
**      Abstract    : This file implements the automatically generated
**                    register and bit field addressing macro definitions.
**
**      Date        : 2004-05-26 17:21:26
**
**      License no. : 9503-663-863-6224     Ivan
**
**      Warning     : This file has been automatically generated.
**                    Do not edit this file if you intend to regenerate it.
**
**      This file was created by IAR MakeApp version
**      4.02A (NXP LPC210x: 4.00C) for the NXP LPC210x component series.
**
**      (c)Copyright 2001-2003 IAR Systems.
**      Your rights to this file are explained in the IAR MakeApp
**      License Agreement. All other rights reserved.
**
*****************************************************************************
*/

/*
**===========================================================================
**  1       GENERAL
**  1.1     Revisions
**
**  
**
**===========================================================================
*/

/*
**===========================================================================
**  1.2     References
** 
**  No   Identification   Name or Description
**  ==   ==============   =====================
** 
**===========================================================================
*/

/*
**===========================================================================
**  1.3     Re-definition guard
**===========================================================================
*/

/*--- Avoid including this file more than once ---*/
#ifndef MA_SFR_DEFINED
#define MA_SFR_DEFINED

/*
**===========================================================================
**  2.      INCLUDE FILES
**  2.1     Standard include files
**===========================================================================
*/

/*
**===========================================================================
**  2.2     Application include files
**===========================================================================
*/

/*--- Include the target specific header file ---*/
#include "ma_tgt.h"

/*
**===========================================================================
**  3.      DECLARATIONS
**  3.1     Global constants
**===========================================================================
*/

/*
**===========================================================================
**  3.2     Global macros
**===========================================================================
*/

#ifndef MA_UNSIGNED_CHAR
#define MA_UNSIGNED_CHAR		*(volatile unsigned char  *)
#endif
#ifndef MA_UNSIGNED_SHORT
#define MA_UNSIGNED_SHORT		*(volatile unsigned short *)
#endif
#ifndef MA_UNSIGNED_LONG
#define MA_UNSIGNED_LONG		*(volatile unsigned long  *)
#endif



/*
**---------------------------------------------------------------------------
**  Watchdog Mode Register
**---------------------------------------------------------------------------
*/

#define WDMOD_WDINT                0x08   /* Bit 3: WDINT (Watchdog interrupt flag (Read Only)) */
#define WDMOD_WDINT_NO_INTERRUPT   0x00   /* No interrupt */
#define WDMOD_WDINT_INTERRUPT      0x01   /* Interrupt */

#define WDMOD_WDTOF                0x04   /* Bit 2: WDTOF (Watchdog time-out flag) */
#define WDMOD_WDTOF_NO_TIME_OUT    0x00   /* No time-out */
#define WDMOD_WDTOF_TIME_OUT       0x01   /* Time-out */

#define WDMOD_WDRESET              0x02   /* Bit 1: WDRESET (Watchdog reset enable bit (Set Only)) */
#define WDMOD_WDRESET_INTERRUPT    0x00   /* Disabled */
#define WDMOD_WDRESET_WDRESET      0x01   /* Enabled */

#define WDMOD_WDEN                 0x01   /* Bit 0: WDEN (Watchdog interrupt enable bit (Set only)) */
#define WDMOD_WDEN_STOPPED         0x00   /* Disabled */
#define WDMOD_WDEN_RUNNING         0x01   /* Enabled (Watchdog interrupt enabled) */


/*
**---------------------------------------------------------------------------
**  Watchdog Timer Constant Register
**---------------------------------------------------------------------------
*/

#define WDTC_COUNT                 0xffffffff /* Bit 31-0: COUNT (Watchdog time-out interval) */


/*
**---------------------------------------------------------------------------
**  Watchdog Feed Sequence Register
**---------------------------------------------------------------------------
*/

#define WDFEED_FEED                0xff   /* Bit 7-0: FEED (Watchdog feed) */


/*
**---------------------------------------------------------------------------
**  Watchdog Timer Value Register
**---------------------------------------------------------------------------
*/

#define WDTV_COUNT                 0xffffffff /* Bit 31-0: COUNT (Watchdog time-out interval) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Interrupt Register
**---------------------------------------------------------------------------
*/

#define T0IR_CR2INT                0x40   /* Bit 6: CR2INT (Interrupt flag for capture channel 2) */
#define T0IR_CR2INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T0IR_CR2INT_INTERRUPT      0x01   /* Interrupt */

#define T0IR_CR1INT                0x20   /* Bit 5: CR1INT (Interrupt flag for capture channel 1) */
#define T0IR_CR1INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T0IR_CR1INT_INTERRUPT      0x01   /* Interrupt */

#define T0IR_CR0INT                0x10   /* Bit 4: CR0INT (Interrupt flag for capture channel 0) */
#define T0IR_CR0INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T0IR_CR0INT_INTERRUPT      0x01   /* Interrupt */

#define T0IR_MR3INT                0x08   /* Bit 3: MR3INT (Interrupt flag for match channel 3) */
#define T0IR_MR3INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T0IR_MR3INT_INTERRUPT      0x01   /* Interrupt */

#define T0IR_MR2INT                0x04   /* Bit 2: MR2INT (Interrupt flag for match channel 2) */
#define T0IR_MR2INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T0IR_MR2INT_INTERRUPT      0x01   /* Interrupt */

#define T0IR_MR1INT                0x02   /* Bit 1: MR1INT (Interrupt flag for match channel 1) */
#define T0IR_MR1INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T0IR_MR1INT_INTERRUPT      0x01   /* Interrupt */

#define T0IR_MR0INT                0x01   /* Bit 0: MR0INT (Interrupt flag for match channel 0) */
#define T0IR_MR0INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T0IR_MR0INT_INTERRUPT      0x01   /* Interrupt */


