iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  PWM Timer Control Register
**---------------------------------------------------------------------------
*/

#define PWMTCR_PWMEN               0x08   /* Bit 3: PWMEN (PWM enable) */
#define PWMTCR_PWMEN_DISABLED      0x00   /* Disabled */
#define PWMTCR_PWMEN_ENABLED       0x01   /* Enabled (Shadow registers operates) */

#define PWMTCR_CR                  0x02   /* Bit 1: CR (Counter reset) */
#define PWMTCR_CR_NO_RESET         0x00   /* No reset */
#define PWMTCR_CR_RESET            0x01   /* Generate reset */

#define PWMTCR_CE                  0x01   /* Bit 0: CE (Counter enable) */
#define PWMTCR_CE_DISABLED         0x00   /* Disabled */
#define PWMTCR_CE_ENABLED          0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  PWM Timer Counter
**---------------------------------------------------------------------------
*/

#define PWMTC_VALUE                0xffffffff /* Bit 31-0: VALUE (PWM counter value) */


/*
**---------------------------------------------------------------------------
**  PWM Prescale Register
**---------------------------------------------------------------------------
*/

#define PWMPR_VALUE                0xffffffff /* Bit 31-0: VALUE (PWM prescaler max value) */


/*
**---------------------------------------------------------------------------
**  PWM Prescale Counter
**---------------------------------------------------------------------------
*/

#define PWMPC_VALUE                0xffffffff /* Bit 31-0: VALUE (PWM prescale counter value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Control Register
**---------------------------------------------------------------------------
*/

#define PWMMCR_MR6STOP             0x100000 /* Bit 20: MR6STOP (Stop on MR6) */
#define PWMMCR_MR6STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR6STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR6RES              0x80000 /* Bit 19: MR6RES (Reset on MR6) */
#define PWMMCR_MR6RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR6RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR6INT              0x40000 /* Bit 18: MR6INT (Interrupt on MR6) */
#define PWMMCR_MR6INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR6INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR5STOP             0x20000 /* Bit 17: MR5STOP (Stop on MR5) */
#define PWMMCR_MR5STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR5STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR5RES              0x10000 /* Bit 16: MR5RES (Reset on MR5) */
#define PWMMCR_MR5RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR5RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR5INT              0x8000 /* Bit 15: MR5INT (Interrupt on MR5) */
#define PWMMCR_MR5INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR5INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR4STOP             0x4000 /* Bit 14: MR4STOP (Stop on MR4) */
#define PWMMCR_MR4STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR4STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR4RES              0x2000 /* Bit 13: MR4RES (Reset on MR4) */
#define PWMMCR_MR4RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR4RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR4INT              0x1000 /* Bit 12: MR4INT (Interrupt on MR4) */
#define PWMMCR_MR4INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR4INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR3STOP             0x800  /* Bit 11: MR3STOP (Stop on MR3) */
#define PWMMCR_MR3STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR3STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR3RES              0x400  /* Bit 10: MR3RES (Reset on MR3) */
#define PWMMCR_MR3RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR3RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR3INT              0x200  /* Bit 9: MR3INT (Interrupt on MR3) */
#define PWMMCR_MR3INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR3INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR2STOP             0x100  /* Bit 8: MR2STOP (Stop on MR2) */
#define PWMMCR_MR2STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR2STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR2RES              0x80   /* Bit 7: MR2RES (Reset on MR2) */
#define PWMMCR_MR2RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR2RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR2INT              0x40   /* Bit 6: MR2INT (Interrupt on MR2) */
#define PWMMCR_MR2INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR2INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR1STOP             0x20   /* Bit 5: MR1STOP (Stop on MR1) */
#define PWMMCR_MR1STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR1STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR1RES              0x10   /* Bit 4: MR1RES (Reset on MR1) */
#define PWMMCR_MR1RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR1RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR1INT              0x08   /* Bit 3: MR1INT (Interrupt on MR1) */
#define PWMMCR_MR1INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR1INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR0STOP             0x04   /* Bit 2: MR0STOP (Stop on MR0) */
#define PWMMCR_MR0STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR0STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR0RES              0x02   /* Bit 1: MR0RES (Reset on MR0) */
#define PWMMCR_MR0RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR0RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR0INT              0x01   /* Bit 0: MR0INT (Interrupt on MR0) */
#define PWMMCR_MR0INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR0INT_ENABLED      0x01   /* Enabled */


