iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  PWM Match Register 0
**---------------------------------------------------------------------------
*/

#define PWMMR0_VALUE               0xffffffff /* Bit 31-0: VALUE (PWM Match value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Register 1
**---------------------------------------------------------------------------
*/

#define PWMMR1_VALUE               0xffffffff /* Bit 31-0: VALUE (PWM Match value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Register 2
**---------------------------------------------------------------------------
*/

#define PWMMR2_VALUE               0xffffffff /* Bit 31-0: VALUE (PWM Match value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Register 3
**---------------------------------------------------------------------------
*/

#define PWMMR3_VALUE               0xffffffff /* Bit 31-0: VALUE (PWM Match value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Register 4
**---------------------------------------------------------------------------
*/

#define PWMMR4_VALUE               0xffffffff /* Bit 31-0: VALUE (PWM Match value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Register 5
**---------------------------------------------------------------------------
*/

#define PWMMR5_VALUE               0xffffffff /* Bit 31-0: VALUE (PWM Match value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Register 6
**---------------------------------------------------------------------------
*/

#define PWMMR6_VALUE               0xffffffff /* Bit 31-0: VALUE (PWM Match value) */


/*
**---------------------------------------------------------------------------
**  PWM Control Register
**---------------------------------------------------------------------------
*/

#define PWMPCR_ENA6                0x4000 /* Bit 14: ENA6 (PWM6 output control) */
#define PWMPCR_ENA6_DISABLED       0x00   /* Disabled */
#define PWMPCR_ENA6_ENABLED        0x01   /* Enabled */

#define PWMPCR_ENA5                0x2000 /* Bit 13: ENA5 (PWM5 output control) */
#define PWMPCR_ENA5_DISABLED       0x00   /* Disabled */
#define PWMPCR_ENA5_ENABLED        0x01   /* Enabled */

#define PWMPCR_ENA4                0x1000 /* Bit 12: ENA4 (PWM4 output control) */
#define PWMPCR_ENA4_DISABLED       0x00   /* Disabled */
#define PWMPCR_ENA4_ENABLED        0x01   /* Enabled */

#define PWMPCR_ENA3                0x800  /* Bit 11: ENA3 (PWM3 output control) */
#define PWMPCR_ENA3_DISABLED       0x00   /* Disabled */
#define PWMPCR_ENA3_ENABLED        0x01   /* Enabled */

#define PWMPCR_ENA2                0x400  /* Bit 10: ENA2 (PWM2 output control) */
#define PWMPCR_ENA2_DISABLED       0x00   /* Disabled */
#define PWMPCR_ENA2_ENABLED        0x01   /* Enabled */

#define PWMPCR_ENA1                0x200  /* Bit 9: ENA1 (PWM1 output control) */
#define PWMPCR_ENA1_DISABLED       0x00   /* Disabled */
#define PWMPCR_ENA1_ENABLED        0x01   /* Enabled */

#define PWMPCR_SEL6                0x40   /* Bit 6: SEL6 (PWM6 select control mode) */
#define PWMPCR_SEL6_SINGLE         0x00   /* Single edge */
#define PWMPCR_SEL6_DOUBLE         0x01   /* Double edge */

#define PWMPCR_SEL5                0x20   /* Bit 5: SEL5 (PWM5 select control mode) */
#define PWMPCR_SEL5_SINGLE         0x00   /* Single edge */
#define PWMPCR_SEL5_DOUBLE         0x01   /* Double edge */

#define PWMPCR_SEL4                0x10   /* Bit 4: SEL4 (PWM4 select control mode) */
#define PWMPCR_SEL4_SINGLE         0x00   /* Single edge */
#define PWMPCR_SEL4_DOUBLE         0x01   /* Double edge */

#define PWMPCR_SEL3                0x08   /* Bit 3: SEL3 (PWM3 select control mode) */
#define PWMPCR_SEL3_SINGLE         0x00   /* Single edge */
#define PWMPCR_SEL3_DOUBLE         0x01   /* Double edge */

#define PWMPCR_SEL2                0x04   /* Bit 2: SEL2 (PWM2 select control mode) */
#define PWMPCR_SEL2_SINGLE         0x00   /* Single edge */
#define PWMPCR_SEL2_DOUBLE         0x01   /* Double edge */

#define PWMPCR_SEL1                0x02   /* Bit 1: SEL1 (PWM1 select control mode) */
#define PWMPCR_SEL1_SINGLE         0x00   /* Single edge */
#define PWMPCR_SEL1_DOUBLE         0x01   /* Double edge */


/*
**---------------------------------------------------------------------------
**  PWM Latch Enable Register
**---------------------------------------------------------------------------
*/

#define PWMLER_EM6L                0x40   /* Bit 6: EM6L (Enable PWM match 6 latch) */
#define PWMLER_EM6L_DISABLED       0x00   /* Disabled */
#define PWMLER_EM6L_ENABLED        0x01   /* Enabled */

#define PWMLER_EM5L                0x20   /* Bit 5: EM5L (Enable PWM match 5 latch) */
#define PWMLER_EM5L_DISABLED       0x00   /* Disabled */
#define PWMLER_EM5L_ENABLED        0x01   /* Enabled */

#define PWMLER_EM4L                0x10   /* Bit 4: EM4L (Enable PWM match 4 latch) */
#define PWMLER_EM4L_DISABLED       0x00   /* Disabled */
#define PWMLER_EM4L_ENABLED        0x01   /* Enabled */

#define PWMLER_EM3L                0x08   /* Bit 3: EM3L (Enable PWM match 3 latch) */
#define PWMLER_EM3L_DISABLED       0x00   /* Disabled */
#define PWMLER_EM3L_ENABLED        0x01   /* Enabled */

#define PWMLER_EM2L                0x04   /* Bit 2: EM2L (Enable PWM match 2 latch) */
#define PWMLER_EM2L_DISABLED       0x00   /* Disabled */
#define PWMLER_EM2L_ENABLED        0x01   /* Enabled */

#define PWMLER_EM1L                0x02   /* Bit 1: EM1L (Enable PWM match 1 latch) */
#define PWMLER_EM1L_DISABLED       0x00   /* Disabled */
#define PWMLER_EM1L_ENABLED        0x01   /* Enabled */

#define PWMLER_EM0L                0x01   /* Bit 0: EM0L (Enable PWM match 0 latch) */
#define PWMLER_EM0L_DISABLED       0x00   /* Disabled */
#define PWMLER_EM0L_ENABLED        0x01   /* Enabled */


