iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  I2C Control Set Register
**---------------------------------------------------------------------------
*/

#define I2CONSET_I2EN              0x40   /* Bit 6: I2EN (I2C interface enable) */
#define I2CONSET_I2EN_DISABLED     0x00   /* Disabled */
#define I2CONSET_I2EN_ENABLED      0x01   /* Enabled */

#define I2CONSET_STA               0x20   /* Bit 5: STA (Start flag) */
#define I2CONSET_STA_NO_START      0x00   /* No start */
#define I2CONSET_STA_START         0x01   /* Start */

#define I2CONSET_STO               0x10   /* Bit 4: STO (Stop flag) */
#define I2CONSET_STO_NO_STOP       0x00   /* No stop */
#define I2CONSET_STO_STOP          0x01   /* Stop */

#define I2CONSET_SI                0x08   /* Bit 3: SI (I2C interrupt flag) */
#define I2CONSET_SI_NO_INTERRUPT   0x00   /* No interrupt */
#define I2CONSET_SI_INTERRUPT      0x01   /* Interrupt */

#define I2CONSET_AA                0x04   /* Bit 2: AA (Assert acknowledge flag) */
#define I2CONSET_AA_NO_ACK         0x00   /* Not Acknowledge (Not Acknowledge will be sent when data byte is received) */
#define I2CONSET_AA_ACK            0x01   /* Acknowledge (Acknowledge will be sent if certain conditions occur) */


/*
**---------------------------------------------------------------------------
**  I2C Status Register
**---------------------------------------------------------------------------
*/

#define I2STAT_STATUS              0xff   /* Bit 7-0: STATUS (Status) */


/*
**---------------------------------------------------------------------------
**  I2C Data Register
**---------------------------------------------------------------------------
*/

#define I2DAT_DATA                 0xff   /* Bit 7-0: DATA (Data) */


/*
**---------------------------------------------------------------------------
**  I2C Slave Address Register
**---------------------------------------------------------------------------
*/

#define I2ADR_ADDR                 0xfe   /* Bit 7-1: ADDR (Slave mode address) */

#define I2ADR_GC                   0x01   /* Bit 0: GC (General call bit) */
#define I2ADR_GC_NOT_GENERAL       0x00   /* Not general call */
#define I2ADR_GC_GENERAL           0x01   /* General call received */


/*
**---------------------------------------------------------------------------
**  I2C SCL Duty Cycle High Register
**---------------------------------------------------------------------------
*/

#define I2SCLH_COUNT               0xffff /* Bit 15-0: COUNT (Count for SCL high time period) */


/*
**---------------------------------------------------------------------------
**  I2C SCL Duty Cycle Low Register
**---------------------------------------------------------------------------
*/

#define I2SCLL_COUNT               0xffff /* Bit 15-0: COUNT (Count for SCL low time period) */


/*
**---------------------------------------------------------------------------
**  I2C Control Clear Register
**---------------------------------------------------------------------------
*/

#define I2CONCLR_I2ENC             0x40   /* Bit 6: I2ENC (I2C interface disable) */
#define I2CONCLR_I2ENC_NO_EFFECT   0x00   /* No effect */
#define I2CONCLR_I2ENC_CLEAR       0x01   /* Clear  (I2C Disabled) */

#define I2CONCLR_STAC              0x20   /* Bit 5: STAC (Start flag clear) */
#define I2CONCLR_STAC_NO_EFFECT    0x00   /* No effect */
#define I2CONCLR_STAC_CLEAR        0x01   /* Clear start */

#define I2CONCLR_SIC               0x08   /* Bit 3: SIC (I2C interrupt clear) */
#define I2CONCLR_SIC_NO_EFFECT     0x00   /* No effect */
#define I2CONCLR_SIC_CLEAR         0x01   /* Clear interrupt */

#define I2CONCLR_AAC               0x04   /* Bit 2: AAC (Assert acknowledge clear) */
#define I2CONCLR_AAC_NO_EFFECT     0x00   /* No effect */
#define I2CONCLR_AAC_CLEAR         0x01   /* Clear acknowledge */


/*
**---------------------------------------------------------------------------
**  SPI Control Register
**---------------------------------------------------------------------------
*/

#define SPCR_SPIE                  0x80   /* Bit 7: SPIE (SPI interrupt enable) */
#define SPCR_SPIE_DISABLED         0x00   /* Disabled */
#define SPCR_SPIE_ENABLED          0x01   /* Enabled */

#define SPCR_LSBF                  0x40   /* Bit 6: LSBF (Direction order (LSB/MSB)) */
#define SPCR_LSBF_MSB_FIRST        0x00   /* MSB first */
#define SPCR_LSBF_LSB_FIRST        0x01   /* LSB first */

#define SPCR_MSTR                  0x20   /* Bit 5: MSTR (Master/slave select) */
#define SPCR_MSTR_SLAVE            0x00   /* Slave */
#define SPCR_MSTR_MASTER           0x01   /* Master */

#define SPCR_CPOL                  0x10   /* Bit 4: CPOL (Clock polarity) */
#define SPCR_CPOL_HIGH             0x00   /* Active high */
#define SPCR_CPOL_LOW              0x01   /* Active low */

#define SPCR_CPHA                  0x08   /* Bit 3: CPHA (Clock phase) */
#define SPCR_CPHA_FIRST            0x00   /* Data sampled on first clock edge */
#define SPCR_CPHA_SECOND           0x01   /* Data sampled on second clock edge */


/*
**---------------------------------------------------------------------------
**  SPI Status Register
**---------------------------------------------------------------------------
*/

#define SPSR_SPIF                  0x80   /* Bit 7: SPIF (SPI transfer complete flag) */
#define SPSR_SPIF_NOT_COMPLETE     0x00   /* Not complete */
#define SPSR_SPIF_COMPLETE         0x01   /* Complete */

#define SPSR_WCOL                  0x40   /* Bit 6: WCOL (Write collision flag) */
#define SPSR_WCOL_NO_COLLISION     0x00   /* No collision */
#define SPSR_WCOL_COLLISION        0x01   /* Collision */

#define SPSR_ROVR                  0x20   /* Bit 5: ROVR (Read overrun flag) */
#define SPSR_ROVR_NO_OVERRUN       0x00   /* No overrun */
#define SPSR_ROVR_OVERRUN          0x01   /* Overrun */

#define SPSR_MODF                  0x10   /* Bit 4: MODF (Mode fauilt flag) */
#define SPSR_MODF_NO_ERROR         0x00   /* No error */
#define SPSR_MODF_ERROR            0x01   /* Error */

#define SPSR_ABRT                  0x08   /* Bit 3: ABRT (Slave abort) */
#define SPSR_ABRT_NO_ABORT         0x00   /* No abort */
#define SPSR_ABRT_ABORT            0x01   /* Abort */


