iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Pin Function Select Register 0
**---------------------------------------------------------------------------
*/

#define PINSEL0_P0_15              0xc0000000 /* Bit 31-30: P0_15 (Port 0.15) */
#define PINSEL0_P0_15_PORT0_15     0x00   /* GPIO Port 0.15 */
#define PINSEL0_P0_15_RI1          0x01   /* RI1 (UART1) */
#define PINSEL0_P0_15_EINT2        0x02   /* EINT2 (INTR) */

#define PINSEL0_P0_14              0x30000000 /* Bit 29-28: P0_14 (Port 0.14) */
#define PINSEL0_P0_14_PORT0_14     0x00   /* GPIO Port 0.14 */
#define PINSEL0_P0_14_DCD1         0x01   /* DCD1 (UART1) */
#define PINSEL0_P0_14_EINT1        0x02   /* EINT1 (INTR) */

#define PINSEL0_P0_13              0xc000000 /* Bit 27-26: P0_13 (Port 0.13) */
#define PINSEL0_P0_13_PORT0_13     0x00   /* GPIO Port 0.13 */
#define PINSEL0_P0_13_DTR1         0x01   /* DTR1 (UART1) */
#define PINSEL0_P0_13_MAT1_1       0x02   /* Match 1.1 (Timer 1) */

#define PINSEL0_P0_12              0x3000000 /* Bit 25-24: P0_12 (Port 0.12) */
#define PINSEL0_P0_12_PORT0_12     0x00   /* GPIO Port 0.12 */
#define PINSEL0_P0_12_DSR1         0x01   /* DSR1 (UART1) */
#define PINSEL0_P0_12_MAT1_0       0x02   /* Match 1.0 (Timer 1) */

#define PINSEL0_P0_11              0xc00000 /* Bit 23-22: P0_11 (Port 0.11) */
#define PINSEL0_P0_11_PORT0_11     0x00   /* GPIO Port 0.11 */
#define PINSEL0_P0_11_CTS1         0x01   /* CTS1 (UART1) */
#define PINSEL0_P0_11_CAP1_1       0x02   /* Capture 1.1 (Timer 1) */

#define PINSEL0_P0_10              0x300000 /* Bit 21-20: P0_10 (Port 0.10) */
#define PINSEL0_P0_10_PORT0_10     0x00   /* GPIO Port 0.10 */
#define PINSEL0_P0_10_RTS1         0x01   /* RTS1  (UART1) */
#define PINSEL0_P0_10_CAP1_0       0x02   /* Capture 1.0 (Timer 1) */

#define PINSEL0_P0_9               0xc0000 /* Bit 19-18: P0_9 (Port 0.9) */
#define PINSEL0_P0_9_PORT0_9       0x00   /* GPIO Port 0.9 */
#define PINSEL0_P0_9_RXD1          0x01   /* RxD1 (UART1) */
#define PINSEL0_P0_9_PWM6          0x02   /* PWM6 */

#define PINSEL0_P0_8               0x30000 /* Bit 17-16: P0_8 (Port 0.8) */
#define PINSEL0_P0_8_PORT0_8       0x00   /* GPIO Port 0.8 */
#define PINSEL0_P0_8_TXD1          0x01   /* TxD1 (UART1) */
#define PINSEL0_P0_8_PWM4          0x02   /* PWM4 */

#define PINSEL0_P0_7               0xc000 /* Bit 15-14: P0_7 (Port 0.7) */
#define PINSEL0_P0_7_PORT0_7       0x00   /* GPIO Port 0.7 */
#define PINSEL0_P0_7_SSEL          0x01   /* SSEL (SPI) */
#define PINSEL0_P0_7_PWM2          0x02   /* PWM2 */

#define PINSEL0_P0_6               0x3000 /* Bit 13-12: P0_6 (Port 0.6) */
#define PINSEL0_P0_6_PORT0_6       0x00   /* GPIO Port 0.6 */
#define PINSEL0_P0_6_MOSI          0x01   /* MOSI (SPI) */
#define PINSEL0_P0_6_CAP0_2        0x02   /* Capture 0.2 (Timer 0) */

#define PINSEL0_P0_5               0xc00  /* Bit 11-10: P0_5 (Port 0.5) */
#define PINSEL0_P0_5_PORT0_5       0x00   /* GPIO Port 0.5 */
#define PINSEL0_P0_5_MISO          0x01   /* MISO (SPI) */
#define PINSEL0_P0_5_MAT0_1        0x02   /* Match 0.1 (Timer 0) */

#define PINSEL0_P0_4               0x300  /* Bit 9-8: P0_4 (Port 0.4) */
#define PINSEL0_P0_4_PORT0_4       0x00   /* GPIO Port 0.4 */
#define PINSEL0_P0_4_SCK           0x01   /* SCK (SPI) */
#define PINSEL0_P0_4_CAP0_1        0x02   /* Capture 0.1 (Timer 0) */

#define PINSEL0_P0_3               0xc0   /* Bit 7-6: P0_3 (Port 0.3) */
#define PINSEL0_P0_3_PORT0_3       0x00   /* GPIO Port 0.3 */
#define PINSEL0_P0_3_SDA           0x01   /* SDA (I2C) */
#define PINSEL0_P0_3_MAT0_0        0x02   /* Match 0.0 (Timer 0) */

#define PINSEL0_P0_2               0x30   /* Bit 5-4: P0_2 (Port 0.2) */
#define PINSEL0_P0_2_PORT0_2       0x00   /* GPIO Port 0.2 */
#define PINSEL0_P0_2_SCL           0x01   /* SCL (I2C) */
#define PINSEL0_P0_2_CAP0_0        0x02   /* Capture 0.0 (Timer 0) */

#define PINSEL0_P0_1               0x0c   /* Bit 3-2: P0_1 (Port 0.1) */
#define PINSEL0_P0_1_PORT0_1       0x00   /* GPIO Port 0.1 */
#define PINSEL0_P0_1_RXD0          0x01   /* RxD0 (UART0) */
#define PINSEL0_P0_1_PWM3          0x02   /* PWM3 */

#define PINSEL0_P0_0               0x03   /* Bit 1-0: P0_0 (Port 0.0) */
#define PINSEL0_P0_0_PORT0_0       0x00   /* GPIO Port 0.0 */
#define PINSEL0_P0_0_TXD0          0x01   /* TxD0 (UART0) */
#define PINSEL0_P0_0_PWM1          0x02   /* PWM1 */


/*
**---------------------------------------------------------------------------
**  Pin Function Select Register 1
**---------------------------------------------------------------------------
*/

#define PINSEL1_P0_31              0xc0000000 /* Bit 31-30: P0_31 (Port 0.31) */
#define PINSEL1_P0_31_PORT0_31     0x00   /* GPIO Port 0.31 */
#define PINSEL1_P0_31_TDO          0x01   /* TDO (JTAG) */

#define PINSEL1_P0_30              0x30000000 /* Bit 29-28: P0_30 (Port 0.30) */
#define PINSEL1_P0_30_PORT0_30     0x00   /* GPIO Port 0.30 */
#define PINSEL1_P0_30_TDI          0x01   /* TDI (JTAG) */

#define PINSEL1_P0_29              0xc000000 /* Bit 27-26: P0_29 (Port 0.29) */
#define PINSEL1_P0_29_PORT0_29     0x00   /* GPIO Port 0.29 */
#define PINSEL1_P0_29_TCK          0x01   /* TCK (JTAG) */

#define PINSEL1_P0_28              0x3000000 /* Bit 25-24: P0_28 (Port 0.28) */
#define PINSEL1_P0_28_PORT0_28     0x00   /* GPIO Port 0.28 */
#define PINSEL1_P0_28_TMS          0x01   /* TMS (JTAG) */

#define PINSEL1_P0_27              0xc00000 /* Bit 23-22: P0_27 (Port 0.27) */
#define PINSEL1_P0_27_PORT0_27     0x00   /* GPIO Port 0.27 */
#define PINSEL1_P0_27_TRST         0x01   /* TRST (JTAG) */

#define PINSEL1_P0_26              0x300000 /* Bit 21-20: P0_26 (Port 0.26) */
#define PINSEL1_P0_26_PORT0_26     0x00   /* GPIO Port 0.26 */

#define PINSEL1_P0_25              0xc0000 /* Bit 19-18: P0_25 (Port 0.25) */
#define PINSEL1_P0_25_PORT0_25     0x00   /* GPIO Port 0.25 */

