iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
#define PINSEL1_P0_24              0x30000 /* Bit 17-16: P0_24 (Port 0.24) */
#define PINSEL1_P0_24_PORT0_24     0x00   /* GPIO Port 0.24 */

#define PINSEL1_P0_23              0xc000 /* Bit 15-14: P0_23 (Port 0.23) */
#define PINSEL1_P0_23_PORT0_23     0x00   /* GPIO Port 0.23 */

#define PINSEL1_P0_22              0x3000 /* Bit 13-12: P0_22 (Port 0.22) */
#define PINSEL1_P0_22_PORT0_22     0x00   /* GPIO Port 0.22 */

#define PINSEL1_P0_21              0xc00  /* Bit 11-10: P0_21 (Port 0.21) */
#define PINSEL1_P0_21_PORT0_21     0x00   /* GPIO Port 0.21 */
#define PINSEL1_P0_21_PWM5         0x01   /* PWM5 */

#define PINSEL1_P0_20              0x300  /* Bit 9-8: P0_20 (Port 0.20) */
#define PINSEL1_P0_20_PORT0_20     0x00   /* GPIO Port 0.20 */
#define PINSEL1_P0_20_MAT1_3       0x01   /* Match 1.3 (Timer 1) */

#define PINSEL1_P0_19              0xc0   /* Bit 7-6: P0_19 (Port 0.19) */
#define PINSEL1_P0_19_PORT0_19     0x00   /* GPIO Port 0.19 */
#define PINSEL1_P0_19_MAT1_2       0x01   /* Match 1.2 (Timer 1) */

#define PINSEL1_P0_18              0x30   /* Bit 5-4: P0_18 (Port 0.18) */
#define PINSEL1_P0_18_PORT0_18     0x00   /* GPIO Port 0.18 */
#define PINSEL1_P0_18_CAP1_3       0x01   /* Capture 1.3 (Timer 1) */

#define PINSEL1_P0_17              0x0c   /* Bit 3-2: P0_17 (Port 0.17) */
#define PINSEL1_P0_17_PORT0_17     0x00   /* GPIO Port 0.17 */
#define PINSEL1_P0_17_CAP1_2       0x01   /* Capture 1.2 (Timer 1) */

#define PINSEL1_P0_16              0x03   /* Bit 1-0: P0_16 (Port 0.16) */
#define PINSEL1_P0_16_PORT0_16     0x00   /* GPIO Port 0.16 */
#define PINSEL1_P0_16_EINT0        0x01   /* EINT0 (INTR) */
#define PINSEL1_P0_16_MAT0_2       0x02   /* Match 0.2 (Timer 0) */


/*
**---------------------------------------------------------------------------
**  MAM Control Register
**---------------------------------------------------------------------------
*/

#define MAMCR_MODECTRL             0x03   /* Bit 1-0: MODECTRL (MAM mode control) */
#define MAMCR_MODECTRL_DISABLED    0x00   /* MAM disabled */
#define MAMCR_MODECTRL_PARTIALLY   0x01   /* MAM partially enabled */
#define MAMCR_MODECTRL_ENABLED     0x02   /* MAM fully enabled */


/*
**---------------------------------------------------------------------------
**  MAM Timing Control Register
**---------------------------------------------------------------------------
*/

#define MAMTIM_CYCLES              0x07   /* Bit 2-0: CYCLES (MAM fetch cycle timing) */
#define MAMTIM_CYCLES_ONE          0x01   /* 1 processor clock */
#define MAMTIM_CYCLES_TWO          0x02   /* 2 processor clock */
#define MAMTIM_CYCLES_THREE        0x03   /* 3 processor clock */
#define MAMTIM_CYCLES_FOUR         0x04   /* 4 processor clock */
#define MAMTIM_CYCLES_FIVE         0x05   /* 5 processor clock */
#define MAMTIM_CYCLES_SIX          0x06   /* 6 processor clock */
#define MAMTIM_CYCLES_SEVEN        0x07   /* 7 processor clock */


/*
**---------------------------------------------------------------------------
**  Memory Mapping Control Register
**---------------------------------------------------------------------------
*/

#define MEMMAP_MAP                 0x03   /* Bit 1-0: MAP (Memory map control) */
#define MEMMAP_MAP_BOOT            0x00   /* Boot loader mode */
#define MEMMAP_MAP_FLASH           0x01   /* Flash mode */
#define MEMMAP_MAP_RAM             0x02   /* RAM mode */


/*
**---------------------------------------------------------------------------
**  PLL Control Register
**---------------------------------------------------------------------------
*/

#define PLLCON_PLLC                0x02   /* Bit 1: PLLC (PLL Connect) */
#define PLLCON_PLLC_DISCONNECTED   0x00   /* Disconnected */
#define PLLCON_PLLC_CONNECTED      0x01   /* Connected */

#define PLLCON_PLLE                0x01   /* Bit 0: PLLE (PLL Enabled) */
#define PLLCON_PLLE_DISABLED       0x00   /* Disabled */
#define PLLCON_PLLE_ENABLED        0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  PLL Configuration Register
**---------------------------------------------------------------------------
*/

#define PLLCFG_PSEL                0x60   /* Bit 6-5: PSEL (PLL Divider value) */

#define PLLCFG_MSEL                0x1f   /* Bit 4-0: MSEL (PLL Multiplier value) */


/*
**---------------------------------------------------------------------------
**  PLL Status Register
**---------------------------------------------------------------------------
*/

#define PLLSTAT_PLOCK              0x400  /* Bit 10: PLOCK (PLL Lock status) */
#define PLLSTAT_PLOCK_UNLOCKED     0x00   /* Unlocked */
#define PLLSTAT_PLOCK_LOCKED       0x01   /* Locked */

#define PLLSTAT_PLLC               0x200  /* Bit 9: PLLC (PLL Connect) */
#define PLLSTAT_PLLC_DISCONNECTED  0x00   /* Disconnected */
#define PLLSTAT_PLLC_CONNECTED     0x01   /* Connected */

#define PLLSTAT_PLLE               0x100  /* Bit 8: PLLE (PLL Enabled) */
#define PLLSTAT_PLLE_DISABLED      0x00   /* Disabled */
#define PLLSTAT_PLLE_ENABLED       0x01   /* Enabled */

#define PLLSTAT_PSEL               0x60   /* Bit 6-5: PSEL (PLL Divider value) */

#define PLLSTAT_MSEL               0x1f   /* Bit 4-0: MSEL (PLL Multiplier value) */


/*
**---------------------------------------------------------------------------
**  PLL Feed Register
**---------------------------------------------------------------------------
*/

#define PLLFEED_FEED               0xff   /* Bit 7-0: FEED (PLL feed) */


/*
**---------------------------------------------------------------------------
**  Power Control Register
**---------------------------------------------------------------------------
*/

#define PCON_PD                    0x02   /* Bit 1: PD (Power down mode) */
#define PCON_PD_DISABLED           0x00   /* Disabled */
#define PCON_PD_ENABLED            0x01   /* Enabled */

#define PCON_IDL                   0x01   /* Bit 0: IDL (Idle mode) */
#define PCON_IDL_DISABLED          0x00   /* Disabled */
#define PCON_IDL_ENABLED           0x01   /* Enabled */


