iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Power Control for Peripherals Register
**---------------------------------------------------------------------------
*/

#define PCONP_PCRTC                0x200  /* Bit 9: PCRTC (Power control RTC) */
#define PCONP_PCRTC_DISABLED       0x00   /* Disabled */
#define PCONP_PCRTC_ENABLED        0x01   /* Enabled */

#define PCONP_PCSPI                0x100  /* Bit 8: PCSPI (Power control SPI) */
#define PCONP_PCSPI_DISABLED       0x00   /* Disabled */
#define PCONP_PCSPI_ENABLED        0x01   /* Enabled */

#define PCONP_PCI2C                0x80   /* Bit 7: PCI2C (Power control I2C) */
#define PCONP_PCI2C_DISABLED       0x00   /* Disabled */
#define PCONP_PCI2C_ENABLED        0x01   /* Enabled */

#define PCONP_PCPWM0               0x20   /* Bit 5: PCPWM0 (Power control PWM0) */
#define PCONP_PCPWM0_DISABLED      0x00   /* Disabled */
#define PCONP_PCPWM0_ENABLED       0x01   /* Enabled */

#define PCONP_PCURT1               0x10   /* Bit 4: PCURT1 (Power control UART1) */
#define PCONP_PCURT1_DISABLED      0x00   /* Disabled */
#define PCONP_PCURT1_ENABLED       0x01   /* Enabled */

#define PCONP_PCURT0               0x08   /* Bit 3: PCURT0 (Power control UART0) */
#define PCONP_PCURT0_DISABLED      0x00   /* Disabled */
#define PCONP_PCURT0_ENABLED       0x01   /* Enabled */

#define PCONP_PCTIM1               0x04   /* Bit 2: PCTIM1 (Power control TIMER1) */
#define PCONP_PCTIM1_DISABLED      0x00   /* Disabled */
#define PCONP_PCTIM1_ENABLED       0x01   /* Enabled */

#define PCONP_PCTIM0               0x02   /* Bit 1: PCTIM0 (Power control TIMER0) */
#define PCONP_PCTIM0_DISABLED      0x00   /* Disabled */
#define PCONP_PCTIM0_ENABLED       0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  VPB Divider Register
**---------------------------------------------------------------------------
*/

#define VPBDIV_VPBDIV              0x03   /* Bit 1-0: VPBDIV (VPB divider) */
#define VPBDIV_VPBDIV_DIV_1        0x01   /* VPB bus clock is same as the processor clock */
#define VPBDIV_VPBDIV_DIV_2        0x02   /* VPB bus clock is 1/2 of the processor clock */
#define VPBDIV_VPBDIV_DIV_4        0x00   /* VPB bus clock is 1/4 of the processor clock */


/*
**---------------------------------------------------------------------------
**  External Interrupt Flag Register
**---------------------------------------------------------------------------
*/

#define EXTINT_EINT2               0x04   /* Bit 2: EINT2 (EINT2 status) */
#define EXTINT_EINT2_NO_INTERRUPT  0x00   /* No interrupt */
#define EXTINT_EINT2_INTERRUPT     0x01   /* Interrupt */

#define EXTINT_EINT1               0x02   /* Bit 1: EINT1 (EINT1 status) */
#define EXTINT_EINT1_NO_INTERRUPT  0x00   /* No interrupt */
#define EXTINT_EINT1_INTERRUPT     0x01   /* Interrupt */

#define EXTINT_EINT0               0x01   /* Bit 0: EINT0 (EINT0 status) */
#define EXTINT_EINT0_NO_INTERRUPT  0x00   /* No interrupt */
#define EXTINT_EINT0_INTERRUPT     0x01   /* Interrupt */


/*
**---------------------------------------------------------------------------
**  External Interrupt Wakeup Register
**---------------------------------------------------------------------------
*/

#define EXTWAKE_EXTWAKE2           0x04   /* Bit 2: EXTWAKE2 (EINT2 wake up) */
#define EXTWAKE_EXTWAKE2_DISABLED  0x00   /* Disabled */
#define EXTWAKE_EXTWAKE2_ENABLED   0x01   /* Enabled */

#define EXTWAKE_EXTWAKE1           0x02   /* Bit 1: EXTWAKE1 (EINT1 wake up) */
#define EXTWAKE_EXTWAKE1_DISABLED  0x00   /* Disabled */
#define EXTWAKE_EXTWAKE1_ENABLED   0x01   /* Enabled */

#define EXTWAKE_EXTWAKE0           0x01   /* Bit 0: EXTWAKE0 (EINT0 wake up) */
#define EXTWAKE_EXTWAKE0_DISABLED  0x00   /* Disabled */
#define EXTWAKE_EXTWAKE0_ENABLED   0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  IRQ Status Register
**---------------------------------------------------------------------------
*/

#define VICIRQSTATUS_INT31         0x80000000 /* Bit 31: INT31 (Interrupt 31) */

#define VICIRQSTATUS_INT30         0x40000000 /* Bit 30: INT30 (Interrupt 30) */

#define VICIRQSTATUS_INT29         0x20000000 /* Bit 29: INT29 (Interrupt 29) */

#define VICIRQSTATUS_INT28         0x10000000 /* Bit 28: INT28 (Interrupt 28) */

#define VICIRQSTATUS_INT27         0x8000000 /* Bit 27: INT27 (Interrupt 27) */

#define VICIRQSTATUS_INT26         0x4000000 /* Bit 26: INT26 (Interrupt 26) */

#define VICIRQSTATUS_INT25         0x2000000 /* Bit 25: INT25 (Interrupt 25) */

#define VICIRQSTATUS_INT24         0x1000000 /* Bit 24: INT24 (Interrupt 24) */

#define VICIRQSTATUS_INT23         0x800000 /* Bit 23: INT23 (Interrupt 23) */

#define VICIRQSTATUS_INT22         0x400000 /* Bit 22: INT22 (Interrupt 22) */

#define VICIRQSTATUS_INT21         0x200000 /* Bit 21: INT21 (Interrupt 21) */

#define VICIRQSTATUS_INT20         0x100000 /* Bit 20: INT20 (Interrupt 20) */

#define VICIRQSTATUS_INT19         0x80000 /* Bit 19: INT19 (Interrupt 19) */

#define VICIRQSTATUS_INT18         0x40000 /* Bit 18: INT18 (Interrupt 18) */

#define VICIRQSTATUS_INT17         0x20000 /* Bit 17: INT17 (Interrupt 17) */

#define VICIRQSTATUS_INT16         0x10000 /* Bit 16: INT16 (Interrupt 16) */

#define VICIRQSTATUS_INT15         0x8000 /* Bit 15: INT15 (Interrupt 15) */

#define VICIRQSTATUS_INT14         0x4000 /* Bit 14: INT14 (Interrupt 14) */

#define VICIRQSTATUS_INT13         0x2000 /* Bit 13: INT13 (Interrupt 13) */

#define VICIRQSTATUS_INT12         0x1000 /* Bit 12: INT12 (Interrupt 12) */

#define VICIRQSTATUS_INT11         0x800  /* Bit 11: INT11 (Interrupt 11) */

#define VICIRQSTATUS_INT10         0x400  /* Bit 10: INT10 (Interrupt 10) */

#define VICIRQSTATUS_INT9          0x200  /* Bit 9: INT9 (Interrupt 9) */

#define VICIRQSTATUS_INT8          0x100  /* Bit 8: INT8 (Interrupt 8) */

#define VICIRQSTATUS_INT7          0x80   /* Bit 7: INT7 (Interrupt 7) */

#define VICIRQSTATUS_INT6          0x40   /* Bit 6: INT6 (Interrupt 6) */

#define VICIRQSTATUS_INT5          0x20   /* Bit 5: INT5 (Interrupt 5) */

#define VICIRQSTATUS_INT4          0x10   /* Bit 4: INT4 (Interrupt 4) */

#define VICIRQSTATUS_INT3          0x08   /* Bit 3: INT3 (Interrupt 3) */

