iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
#define VICINTSELECT_INT30         0x40000000 /* Bit 30: INT30 (Interrupt 30) */
#define VICINTSELECT_INT30_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT30_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT29         0x20000000 /* Bit 29: INT29 (Interrupt 29) */
#define VICINTSELECT_INT29_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT29_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT28         0x10000000 /* Bit 28: INT28 (Interrupt 28) */
#define VICINTSELECT_INT28_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT28_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT27         0x8000000 /* Bit 27: INT27 (Interrupt 27) */
#define VICINTSELECT_INT27_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT27_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT26         0x4000000 /* Bit 26: INT26 (Interrupt 26) */
#define VICINTSELECT_INT26_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT26_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT25         0x2000000 /* Bit 25: INT25 (Interrupt 25) */
#define VICINTSELECT_INT25_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT25_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT24         0x1000000 /* Bit 24: INT24 (Interrupt 24) */
#define VICINTSELECT_INT24_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT24_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT23         0x800000 /* Bit 23: INT23 (Interrupt 23) */
#define VICINTSELECT_INT23_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT23_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT22         0x400000 /* Bit 22: INT22 (Interrupt 22) */
#define VICINTSELECT_INT22_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT22_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT21         0x200000 /* Bit 21: INT21 (Interrupt 21) */
#define VICINTSELECT_INT21_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT21_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT20         0x100000 /* Bit 20: INT20 (Interrupt 20) */
#define VICINTSELECT_INT20_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT20_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT19         0x80000 /* Bit 19: INT19 (Interrupt 19) */
#define VICINTSELECT_INT19_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT19_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT18         0x40000 /* Bit 18: INT18 (Interrupt 18) */
#define VICINTSELECT_INT18_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT18_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT17         0x20000 /* Bit 17: INT17 (Interrupt 17) */
#define VICINTSELECT_INT17_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT17_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT16         0x10000 /* Bit 16: INT16 (Interrupt 16) */
#define VICINTSELECT_INT16_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT16_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT15         0x8000 /* Bit 15: INT15 (Interrupt 15) */
#define VICINTSELECT_INT15_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT15_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT14         0x4000 /* Bit 14: INT14 (Interrupt 14) */
#define VICINTSELECT_INT14_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT14_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT13         0x2000 /* Bit 13: INT13 (Interrupt 13) */
#define VICINTSELECT_INT13_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT13_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT12         0x1000 /* Bit 12: INT12 (Interrupt 12) */
#define VICINTSELECT_INT12_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT12_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT11         0x800  /* Bit 11: INT11 (Interrupt 11) */
#define VICINTSELECT_INT11_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT11_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT10         0x400  /* Bit 10: INT10 (Interrupt 10) */
#define VICINTSELECT_INT10_IRQ     0x00   /* IRQ category */
#define VICINTSELECT_INT10_FIQ     0x01   /* FIQ category */

#define VICINTSELECT_INT9          0x200  /* Bit 9: INT9 (Interrupt 9) */
#define VICINTSELECT_INT9_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT9_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT8          0x100  /* Bit 8: INT8 (Interrupt 8) */
#define VICINTSELECT_INT8_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT8_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT7          0x80   /* Bit 7: INT7 (Interrupt 7) */
#define VICINTSELECT_INT7_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT7_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT6          0x40   /* Bit 6: INT6 (Interrupt 6) */
#define VICINTSELECT_INT6_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT6_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT5          0x20   /* Bit 5: INT5 (Interrupt 5) */
#define VICINTSELECT_INT5_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT5_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT4          0x10   /* Bit 4: INT4 (Interrupt 4) */
#define VICINTSELECT_INT4_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT4_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT3          0x08   /* Bit 3: INT3 (Interrupt 3) */
#define VICINTSELECT_INT3_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT3_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT2          0x04   /* Bit 2: INT2 (Interrupt 2) */
#define VICINTSELECT_INT2_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT2_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT1          0x02   /* Bit 1: INT1 (Interrupt 1) */
#define VICINTSELECT_INT1_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT1_FIQ      0x01   /* FIQ category */

#define VICINTSELECT_INT0          0x01   /* Bit 0: INT0 (Interrupt 0) */
#define VICINTSELECT_INT0_IRQ      0x00   /* IRQ category */
#define VICINTSELECT_INT0_FIQ      0x01   /* FIQ category */


