iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Interrupt Enable Register
**---------------------------------------------------------------------------
*/

#define VICINTENABLE_INT31         0x80000000 /* Bit 31: INT31 (Interrupt 31) */
#define VICINTENABLE_INT31_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT31_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT30         0x40000000 /* Bit 30: INT30 (Interrupt 30) */
#define VICINTENABLE_INT30_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT30_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT29         0x20000000 /* Bit 29: INT29 (Interrupt 29) */
#define VICINTENABLE_INT29_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT29_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT28         0x10000000 /* Bit 28: INT28 (Interrupt 28) */
#define VICINTENABLE_INT28_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT28_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT27         0x8000000 /* Bit 27: INT27 (Interrupt 27) */
#define VICINTENABLE_INT27_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT27_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT26         0x4000000 /* Bit 26: INT26 (Interrupt 26) */
#define VICINTENABLE_INT26_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT26_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT25         0x2000000 /* Bit 25: INT25 (Interrupt 25) */
#define VICINTENABLE_INT25_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT25_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT24         0x1000000 /* Bit 24: INT24 (Interrupt 24) */
#define VICINTENABLE_INT24_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT24_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT23         0x800000 /* Bit 23: INT23 (Interrupt 23) */
#define VICINTENABLE_INT23_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT23_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT22         0x400000 /* Bit 22: INT22 (Interrupt 22) */
#define VICINTENABLE_INT22_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT22_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT21         0x200000 /* Bit 21: INT21 (Interrupt 21) */
#define VICINTENABLE_INT21_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT21_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT20         0x100000 /* Bit 20: INT20 (Interrupt 20) */
#define VICINTENABLE_INT20_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT20_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT19         0x80000 /* Bit 19: INT19 (Interrupt 19) */
#define VICINTENABLE_INT19_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT19_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT18         0x40000 /* Bit 18: INT18 (Interrupt 18) */
#define VICINTENABLE_INT18_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT18_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT17         0x20000 /* Bit 17: INT17 (Interrupt 17) */
#define VICINTENABLE_INT17_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT17_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT16         0x10000 /* Bit 16: INT16 (Interrupt 16) */
#define VICINTENABLE_INT16_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT16_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT15         0x8000 /* Bit 15: INT15 (Interrupt 15) */
#define VICINTENABLE_INT15_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT15_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT14         0x4000 /* Bit 14: INT14 (Interrupt 14) */
#define VICINTENABLE_INT14_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT14_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT13         0x2000 /* Bit 13: INT13 (Interrupt 13) */
#define VICINTENABLE_INT13_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT13_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT12         0x1000 /* Bit 12: INT12 (Interrupt 12) */
#define VICINTENABLE_INT12_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT12_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT11         0x800  /* Bit 11: INT11 (Interrupt 11) */
#define VICINTENABLE_INT11_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT11_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT10         0x400  /* Bit 10: INT10 (Interrupt 10) */
#define VICINTENABLE_INT10_DISABLED  0x00 /* Disabled */
#define VICINTENABLE_INT10_ENABLED  0x01  /* Enabled */

#define VICINTENABLE_INT9          0x200  /* Bit 9: INT9 (Interrupt 9) */
#define VICINTENABLE_INT9_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT9_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT8          0x100  /* Bit 8: INT8 (Interrupt 8) */
#define VICINTENABLE_INT8_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT8_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT7          0x80   /* Bit 7: INT7 (Interrupt 7) */
#define VICINTENABLE_INT7_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT7_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT6          0x40   /* Bit 6: INT6 (Interrupt 6) */
#define VICINTENABLE_INT6_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT6_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT5          0x20   /* Bit 5: INT5 (Interrupt 5) */
#define VICINTENABLE_INT5_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT5_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT4          0x10   /* Bit 4: INT4 (Interrupt 4) */
#define VICINTENABLE_INT4_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT4_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT3          0x08   /* Bit 3: INT3 (Interrupt 3) */
#define VICINTENABLE_INT3_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT3_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT2          0x04   /* Bit 2: INT2 (Interrupt 2) */
#define VICINTENABLE_INT2_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT2_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT1          0x02   /* Bit 1: INT1 (Interrupt 1) */
#define VICINTENABLE_INT1_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT1_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT0          0x01   /* Bit 0: INT0 (Interrupt 0) */
#define VICINTENABLE_INT0_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT0_ENABLED  0x01   /* Enabled */


