iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Protection Enable Register
**---------------------------------------------------------------------------
*/

#define VICPROTECTION_PROTECT      0x01   /* Bit 0: PROTECT (VIC register protection) */
#define VICPROTECTION_PROTECT_USER_PRIVELEGED  0x00 /* Access in User mode and Priveleged mode */
#define VICPROTECTION_PROTECT_PRIVELEGED  0x01 /* Access in Priveleged mode only */


/*
**---------------------------------------------------------------------------
**  Vector Address Register
**---------------------------------------------------------------------------
*/

#define VICVECTADDR_ADDRESS        0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Default Vector Address Register
**---------------------------------------------------------------------------
*/

#define VICDEFVECTADDR_ADDRESS     0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 0
**---------------------------------------------------------------------------
*/

#define VICVECTADDR0_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 1
**---------------------------------------------------------------------------
*/

#define VICVECTADDR1_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 2
**---------------------------------------------------------------------------
*/

#define VICVECTADDR2_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 3
**---------------------------------------------------------------------------
*/

#define VICVECTADDR3_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 4
**---------------------------------------------------------------------------
*/

#define VICVECTADDR4_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 5
**---------------------------------------------------------------------------
*/

#define VICVECTADDR5_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 6
**---------------------------------------------------------------------------
*/

#define VICVECTADDR6_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 7
**---------------------------------------------------------------------------
*/

#define VICVECTADDR7_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 8
**---------------------------------------------------------------------------
*/

#define VICVECTADDR8_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 9
**---------------------------------------------------------------------------
*/

#define VICVECTADDR9_ADDRESS       0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 10
**---------------------------------------------------------------------------
*/

#define VICVECTADDR10_ADDRESS      0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 11
**---------------------------------------------------------------------------
*/

#define VICVECTADDR11_ADDRESS      0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 12
**---------------------------------------------------------------------------
*/

#define VICVECTADDR12_ADDRESS      0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 13
**---------------------------------------------------------------------------
*/

#define VICVECTADDR13_ADDRESS      0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 14
**---------------------------------------------------------------------------
*/

#define VICVECTADDR14_ADDRESS      0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Address Register 15
**---------------------------------------------------------------------------
*/

#define VICVECTADDR15_ADDRESS      0xffffffff /* Bit 31-0: ADDRESS (Vector address) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 0
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL0_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL0_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL0_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL0_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


