iarsystems/ewarm-nxp-example-projects/LPC2106/Pasat-MB40/Uart/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Vector Control Register 13
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL13_ENABLED      0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL13_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL13_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL13_NUMBER       0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 14
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL14_ENABLED      0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL14_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL14_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL14_NUMBER       0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 15
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL15_ENABLED      0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL15_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL15_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL15_NUMBER       0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */

/*
**===========================================================================
**  3.3     Global type definitions
**===========================================================================
*/

/*
**===========================================================================
**  3.4     Global variables (defined in some implementation file)
**===========================================================================
*/

/*
**===========================================================================
**  4.      GLOBAL FUNCTIONS (defined in some implementation file)
**===========================================================================
*/


#endif /* Match the re-definition guard */

/*
**===========================================================================
** END OF FILE
**===========================================================================
*/ 
